         alert("sda")
         function searchByNumber() {
             // Реализация поиска по номеру сотрудника
         }
        

         function searchByName() {
             // Реализация поиска по имени сотрудника
         }

         function showAllEmployees() {
             // Реализация вывода информации обо всех сотрудниках
         }

         function deleteEmployee(employeeId) {
             // Реализация удаления сотрудника
             if (confirm("Вы уверены, что хотите удалить этого сотрудника?")) {
                 // Здесь можно добавить логику удаления сотрудника, например, отправку запроса на сервер
                 // После успешного удаления обновите таблицу или выполните другие необходимые действия
                 alert("Сотрудник удален успешно.")
             }
         }
